[
  {
    "groupName": "Relaciones y comunicación",
    "description": "Este grupo se enfoca en la capacidad de trabajar eficazmente con otros y las habilidades esenciales para construir relaciones fuertes y ambientes de trabajo agradable.",
    "id":"relations",
    "groupIcon": "tabler:yin-yang-filled",
    "colors": {
      "bg-clr1": "#9F98FA",
      "bg-clr2": "#BF98FA",
      "border-clr": "#98D0FA",
      "rise-clr": "#98EEFA",
      "op-clr": "#FAE5B9"
    },
    "items": [
      {
        "name": "Trabajo en Equipo",
        "skillIcon": "tabler:heart-handshake",
        "description": "Capacidad para colaborar con otros de manera eficiente y armoniosa para alcanzar objetivos comunes.",
        "levels": [
          { "level": 1, "description": "Participa activamente en equipos pequeños, cumpliendo tareas asignadas bajo supervisión directa." },
          { "level": 2, "description": "Contribuye con ideas en discusiones grupales y apoya la resolución de conflictos básicos dentro del equipo." },
          { "level": 3, "description": "Colabora eficazmente en equipos diversos, aportando soluciones creativas y promoviendo una comunicación fluida." },
          { "level": 4, "description": "Asume roles de liderazgo ocasionales, delega tareas de manera justa y fomenta un ambiente colaborativo positivo." },
          { "level": 5, "description": "Lidera equipos multidisciplinarios, gestiona dinámicas complejas y asegura el cumplimiento de objetivos colectivos con alta efectividad." }
        ],
        "currentLevel" : 4
      },
      {
        "name": "Empatía",
        "skillIcon": "tabler:hearts",
        "description": "Habilidad para comprender y compartir los sentimientos y perspectivas de los demás.",
        "levels": [
          { "level": 1, "description": "Reconoce emociones básicas en interacciones directas." },
          { "level": 2, "description": "Escucha activamente y responde de manera respetuosa a emociones ajenas." },
          { "level": 3, "description": "Identifica necesidades implícitas en diferentes contextos sociales." },
          { "level": 4, "description": "Adapta su comportamiento para apoyar emocionalmente a otros de manera efectiva." },
          { "level": 5, "description": "Construye relaciones profundas y significativas basadas en la comprensión emocional y cultural." }
        ],
        "currentLevel" : 5
      },
      {
        "name": "Comunicación efectiva",
        "skillIcon": "tabler:bubble-text",
        "description": "Capacidad para expresar ideas de manera clara y adaptada al público objetivo.",
        "levels": [
          { "level": 1, "description": "Comunica información básica con claridad en entornos informales." },
          { "level": 2, "description": "Utiliza diferentes formatos (escrito, verbal) para transmitir ideas de manera efectiva." },
          { "level": 3, "description": "Adecúa su comunicación al nivel de conocimiento y contexto del receptor." },
          { "level": 4, "description": "Influye positivamente en discusiones y toma de decisiones al estructurar mensajes persuasivos." },
          { "level": 5, "description": "Diseña estrategias comunicativas complejas para transmitir mensajes clave en entornos diversos." }
        ],
        "currentLevel" : 2
      }
    ]
  },
  {
    "groupName": "Precisión y análisis",
    "description": "Este grupo se centra en la capacidad de observar, analizar y entender detalles importantes. Son habilidades clave para el trabajo meticuloso y la toma de decisiones informada.",
    "id": "prec",
    "groupIcon": "tabler:hexagons",
    "colors": {
      "bg-clr1": "#8DFA94",
      "bg-clr2": "#DFFA8C",
      "border-clr": "#B1FA8C",
      "rise-clr": "#8CFADE",
      "op-clr": "#FAAFC5"
    },
    "items": [
      {
        "name": "Atención al Detalle",
        "skillIcon": "tabler:zoom-in",
        "description": "Capacidad para identificar errores, inconsistencias o áreas de mejora en un trabajo o proceso.",
        "levels": [
          { "level": 1, "description": "Identifica errores recurrentes en tareas asignadas." },
          { "level": 2, "description": "Revisa su trabajo para asegurar cumplimiento de estándares básicos." },
          { "level": 3, "description": "Detecta detalles sutiles que otros han pasado por alto." },
          { "level": 4, "description": "Optimiza procesos mediante un análisis detallado y minucioso." },
          { "level": 5, "description": "Diseña sistemas robustos que minimizan errores e inconsistencias desde el inicio." }
        ],
        "currentLevel" : 3
      },
      {
        "name": "Pensamiento crítico",
        "skillIcon": "tabler:chart-radar",
        "description": "Habilidad para analizar y evaluar información objetivamente. Es dudar para llegar a validar.",
        "levels": [
          { "level": 1, "description": "Identifica información relevante en planteamientos simples." },
          { "level": 2, "description": "Cuestiona supuestos y busca evidencia en experiencias." },
          { "level": 3, "description": "Evalúa diferentes perspectivas para llegar a conclusiones informadas." },
          { "level": 4, "description": "Aplica razonamiento lógico a problemas complejos y multidimensionales." },
          { "level": 5, "description": "Desarrolla soluciones estratégicas basadas en un análisis profundo y multifacético." }
        ],
        "currentLevel" : 3
      },
      {
        "name": "Curiosidad Intelectual",
        "skillIcon": "tabler:seeding",
        "description": "Deseo constante de aprender, explorar y mejorar el conocimiento en diversos campos.",
        "levels": [
          { "level": 1, "description": "Explora temas nuevos ocasionalmente por curiosidad personal." },
          { "level": 2, "description": "Busca activamente información adicional sobre temas de interés." },
          { "level": 3, "description": "Investiga a profundidad temas complejos para ampliar su entendimiento." },
          { "level": 4, "description": "Aplica conocimientos adquiridos a nuevos contextos para generar soluciones innovadoras." },
          { "level": 5, "description": "Conecta ideas interdisciplinarias y fomenta el aprendizaje en su entorno." }
        ],
        "currentLevel" : 2
      }
    ]
  },
  {
    "groupName": "Flexibilidad y resolución",
    "description": "Este grupo incluye habilidades que permiten adaptarse a situaciones adversas con resultados positivos. Son cruciales para afrontar situaciones dinámicas y cumplir objetivos.",
    "id":"flex",
    "groupIcon": "tabler:chess-queen",
    "colors": {
      "bg-clr1": "#FAC89F",
      "bg-clr2": "#FAA9A0",
      "border-clr": "#FAB9A0",
      "rise-clr": "#FAD7A0",
      "op-clr": "#8CFADE"
    },
    "items": [
      {
        "name": "Adaptabilidad",
        "skillIcon": "tabler:puzzle",
        "description": "Habilidad para ajustarse rápidamente a nuevos entornos, roles o situaciones.",
        "levels": [
          { "level": 1, "description": "Se adapta a pequeños cambios en tareas rutinarias." },
          { "level": 2, "description": "Acepta cambios inesperados con una actitud positiva." },
          { "level": 3, "description": "Se ajusta eficazmente a entornos dinámicos y colabora en el cambio." },
          { "level": 4, "description": "Propone estrategias para mejorar la transición en cambios organizacionales." },
          { "level": 5, "description": "Lidera con éxito en contextos de incertidumbre y cambio constante." }
        ],
        "currentLevel" : 3
      },
      {
        "name": "Gestión de tiempo",
        "skillIcon": "tabler:device-watch-stats",
        "description": "Capacidad para organizar tareas y cumplir objetivos de manera eficiente.",
        "levels": [
          { "level": 1, "description": "Cumple con tareas básicas dentro de plazos establecidos." },
          { "level": 2, "description": "Prioriza tareas de acuerdo con su dificulta e impacto." },
          { "level": 3, "description": "Planifica y gestiona múltiples tareas de forma efectiva." },
          { "level": 4, "description": "Optimiza el uso del tiempo mediante herramientas y técnicas avanzadas." },
          { "level": 5, "description": "Desarrolla estrategias de gestión del tiempo para equipos enteros." }
        ],
        "currentLevel" : 3
      },
      {
        "name": "Resolución de problemas",
        "skillIcon": "tabler:tools",
        "description": "Habilidad para identificar, analizar y solucionar desafíos de manera oportuna.",
        "levels": [
          { "level": 1, "description": "Resuelve situaciones cotidianas reconociendo los eventos que lo provocaron." },
          { "level": 2, "description": "Identifica patrones en problemas recurrentes y aplica enfoques preventivos." },
          { "level": 3, "description": "Aborda problemas complejos analizando múltiples variables y posibles impactos antes de decidir." },
          { "level": 4, "description": "Desestructura problemas complejos y crea estrategias enfocadas en maximizar el impacto con el menor esfuerzo posible." },
          { "level": 5, "description": "Anticipa problemas futuros basándose en experiencias, tendencias y datos, creando estrategias preventivas." }
        ],
        "currentLevel" : 3
      }
    ]
  }
]
