{
  "technologies" : [
    {
      "name": "VS Code",
      "logo": "devicon:vscode",
      "description": "Es un editor de código fuente que cuenta con numerosas cualidades que facilitan el desarrollo. Gracias a las múltiples extensiones e integraciones posibles, se convierte en una herramienta indispensable para el desarrollo web.",
      "link": "https://code.visualstudio.com/docs"
    },
    {
      "name": "Git",
      "logo": "devicon:git",
      "description": "Es un sistema de control de versiones que nos permite dejar registro de los cambios realizados en un proyecto. Además, podemos trabajar con diferentes versiones y regresar a estados específicos cuando sea necesario.",
      "link": "https://learn.microsoft.com/es-es/devops/develop/git/what-is-git"
    },
    {
      "name": "GitHub",
      "logo": "devicon:github",
      "description": "Es una plataforma de desarrollo colaborativo basada en Git. Permite almacenar y gestionar proyectos, colaborar con otros desarrolladores y mantener un historial de cambios. Con funciones como issues y pull requests. Es una herramienta esencial para el desarrollo y la gestión de proyectos de software.",
      "link": "https://docs.github.com/get-started"
    },
    {
      "name": "React",
      "logo": "devicon:react",
      "description": "Es la biblioteca para construcción de interfaces de usuario más usada, permite crear componentes reutilizables y gestionar el estado de manera eficiente.",
      "link": "https://es.react.dev/reference/react"
    },
    {
      "name": "Astro",
      "logo": "devicon:astro",
      "description": "Es un framework de desarrollo web estático que permite crear sitios rápidos y optimizados. Astro utiliza una arquitectura basada en componentes y aprovecha el renderizado en el servidor para generar páginas estáticas.",
      "link": "https://docs.astro.build/en/concepts/why-astro/"
    },
    {
      "name": "Tailwind",
      "logo": "devicon:tailwindcss",
      "description": "Es un framework de CSS con el que puedes agregar estilos a través de clases utilitarias en tus elementos HTML o componentes.",
      "link": "https://tailwindcss.com/docs/installation"
    },
    {
      "name": "Sass",
      "logo": "devicon:sass",
      "description": "Es un preprocesador de CSS que extiende las capacidades del CSS tradicional. Permite el uso de variables, anidamiento, mixins, y otras características avanzadas que facilitan la escritura y el mantenimiento de estilos complejos.",
      "link": "https://sass-lang.com/documentation/"
    },
    {
      "name": "Vite",
      "logo": "devicon:vitejs",
      "description": "Es un build tool de frontend que ofrece un entorno de desarrollo ultrarrápido y eficiente. Desarrollado por el creador de Vue.js, Vite utiliza un servidor de desarrollo basado en ES modules y un proceso de compilación optimizado.",
      "link": "https://vitejs.dev/guide/"
    },
    {
      "name": "HTML",
      "logo": "devicon:html5",
      "description": "Lenguaje de marcado de hipertexto por sus siglas en inglés, nos permite estructurar el contenido de un sitio web por medio de etiquetas.",
      "link": "https://developer.mozilla.org/es/docs/Web/HTML"
    },
    {
      "name": "CSS",
      "logo": "devicon:css3",
      "description": "Hojas de estilo en cascada por sus siglas en inglés, es la forma en que definimos los atributos visuales que tendrán las etiquetas de HTML.",
      "link": "https://developer.mozilla.org/es/docs/Web/CSS"
    },
    {
      "name": "Javascript",
      "logo": "devicon:javascript",
      "description": "Es el lenguaje de programacion de la web, con el agregamos interactividad a los elementos de nuestro sitio, controlamos el flujo de datos, personalizamos la experiencia del usuario y mucho mas.",
      "link": "https://developer.mozilla.org/es/docs/Web/JavaScript"
    },
    {
      "name": "Typescript",
      "logo": "devicon:typescript",
      "description": "Actúa una capa por encima de javascript, nos ayuda a reducir comportamientos inesperados cuando manejamos datos de diferentes tipos. Su uso afecta únicamente la experiencia de desarrollo así que no tiene un impacto evidenciable en el resultado final.",
      "link": "https://www.typescriptlang.org/docs/handbook/typescript-in-5-minutes.html"
    },
    {
      "name": "Node Js",
      "logo": "devicon:nodejs",
      "description": "Es un entorno de ejecución de Javascript, lo que nos permite hacer que JS  funcione fuera del navegador, ampliando las posibilidades de javascript para correr en sinnúmero de dispositivos.",
      "link": "https://nodejs.org/docs/latest/api/synopsis.html"
    },
    {
      "name": "Express",
      "logo": "devicon:express",
      "description": "Es una framework de Node Js para la web, facilita la creación  de APIs web por todas las funcionalidades que proporciona para el manejo de rutas, peticiones, respuestas y middlewares.",
      "link": "https://expressjs.com/en/5x/api.html"
    }
  ]
}